In [ ]:
import pandas as pd

# Loading  the CSV file into a DataFrame
df = pd.read_csv(r"C:\Users\sanke\Downloads\salaryData.csv")

# Display the first few rows of the DataFrame
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [6]:
# Display the shape of the DataFrame
df.shape

(375, 6)

In [7]:
# Displaying  the summary statistics of the DataFrame
df.describe()

              Age  Years of Experience         Salary
count  373.000000           373.000000     373.000000
mean    37.431635            10.030831  100577.345845
std      7.069073             6.557007   48240.013482
min     23.000000             0.000000     350.000000
25%     31.000000             4.000000   55000.000000
50%     36.000000             9.000000   95000.000000
75%     44.000000            15.000000  140000.000000
max     53.000000            25.000000  250000.000000

In [8]:
#displaying the data trypes of each column
df.isnull().sum()

Age                    2
Gender                 2
Education Level        2
Job Title              2
Years of Experience    2
Salary                 2
dtype: int64

In [ ]:
#dropping null values
df = df.dropna()

In [ ]:
#displaying the data types after dropping null values
df.isnull().sum()

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

In [ ]:
#summary statistics for the data frame after dropping null values
df.describe()

              Age  Years of Experience         Salary
count  373.000000           373.000000     373.000000
mean    37.431635            10.030831  100577.345845
std      7.069073             6.557007   48240.013482
min     23.000000             0.000000     350.000000
25%     31.000000             4.000000   55000.000000
50%     36.000000             9.000000   95000.000000
75%     44.000000            15.000000  140000.000000
max     53.000000            25.000000  250000.000000

In [ ]:
# Displaying the first few rows of the DataFrame after cleaning
df.dtypes

Age                    float64
Gender                  object
Education Level         object
Job Title               object
Years of Experience    float64
Salary                 float64
dtype: object

In [ ]:
# Displaying the unique values in the 'Job Title' column
df['Job Title'].value_counts()

Job Title
Director of Marketing              12
Director of Operations             11
Senior Business Analyst            10
Senior Marketing Analyst            9
Senior Marketing Manager            9
                                   ..
Business Development Manager        1
Customer Service Representative     1
IT Manager                          1
Digital Marketing Manager           1
Junior Web Developer                1
Name: count, Length: 174, dtype: int64

In [18]:
# Displaying the unique values in the 'Education Level' column
df['Education Level'].value_counts()

Education Level
Bachelor's    224
Master's       98
PhD            51
Name: count, dtype: int64

In [19]:
#Displaying the first few rows of the filtered DataFrame 
df_edited = df.groupby('Job Title').filter(lambda x : len(x)>4)
df_edited.info()
df_edited['Job Title'].value_counts()

<class 'pandas.core.frame.DataFrame'>
Index: 147 entries, 47 to 374
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  147 non-null    float64
 1   Gender               147 non-null    object
 2   Education Level      147 non-null    object
 3   Job Title            147 non-null    object
 4   Years of Experience  147 non-null    float64
 5   Salary               147 non-null    float64
dtypes: float64(3), object(3)
memory usage: 8.0+ KB

Job Title
Director of Marketing                    12
Director of Operations                   11
Senior Business Analyst                  10
Senior Marketing Manager                  9
Senior Marketing Analyst                  9
Junior Business Analyst                   8
Senior Data Scientist                     7
Senior Financial Analyst                  7
Senior Project Manager                    7
Junior Business Development Associate     7
Junior Financial Analyst                  7
Junior Marketing Coordinator              6
Senior Product Manager                    6
Senior Software Engineer                  6
Junior Marketing Specialist               5
Junior Project Manager                    5
Senior Product Designer                   5
Junior Operations Analyst                 5
Senior Operations Manager                 5
Senior Project Coordinator                5
Senior Financial Manager                  5
Name: count, dtype: int64

In [20]:
# Displaying the data types after converting 'Job Title' to category
df['Job Title'] = df['Job Title'].astype('category')

In [22]:
# Displaying the first few rows of the DataFrame after encoding
df_edited['Job Title Encoded'] = df_edited['Job Title'].astype('category').cat.codes
df_edited.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Job Title Encoded
47,45.0,Female,Master's,Director of Marketing,16.0,180000.0,0
60,51.0,Female,Master's,Director of Operations,23.0,170000.0,1
63,47.0,Male,PhD,Senior Data Scientist,21.0,180000.0,10
69,49.0,Female,Master's,Senior Financial Analyst,18.0,150000.0,11
77,32.0,Male,Master's,Senior Software Engineer,6.0,100000.0,20

In [ ]:
df_edited.dtypes
# Displaying the data types of the DataFrame after encoding

Age                     float64
Gender                   object
Education Level          object
Job Title              category
Years of Experience     float64
Salary                  float64
Job Title Encoded          int8
dtype: object

In [ ]:
df_edited['Education Level'] = df_edited['Education Level'].astype('category')

In [ ]:
df_edited.dtypes

Age                        float64
Gender                      object
Education Level           category
Job Title                 category
Years of Experience        float64
Salary                     float64
Job Title Encoded             int8
Eduation Level Encoded        int8
dtype: object

In [26]:
df_edited['Eduation Level Encoded'] = df_edited['Education Level'].cat.codes
# Displaying the first few rows of the DataFrame after encoding education level
df_edited.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Job Title Encoded,Eduation Level Encoded
47,45.0,Female,Master's,Director of Marketing,16.0,180000.0,0,1
60,51.0,Female,Master's,Director of Operations,23.0,170000.0,1,1
63,47.0,Male,PhD,Senior Data Scientist,21.0,180000.0,10,2
69,49.0,Female,Master's,Senior Financial Analyst,18.0,150000.0,11,1
77,32.0,Male,Master's,Senior Software Engineer,6.0,100000.0,20,1

In [29]:
df_edited['Gender'] = df_edited['Gender'].astype('category')

In [31]:
df_edited['Gender Encoded'] = df_edited['Gender'].cat.codes
df_edited.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Job Title Encoded,Eduation Level Encoded,Gender Encoded
47,45.0,Female,Master's,Director of Marketing,16.0,180000.0,0,1,0
60,51.0,Female,Master's,Director of Operations,23.0,170000.0,1,1,0
63,47.0,Male,PhD,Senior Data Scientist,21.0,180000.0,10,2,1
69,49.0,Female,Master's,Senior Financial Analyst,18.0,150000.0,11,1,0
77,32.0,Male,Master's,Senior Software Engineer,6.0,100000.0,20,1,1

In [ ]:
# Displaying the final DataFrame after dropping unnecessary columns
df_final = df_edited.drop(['Gender', 'Education Level', 'Job Title'], axis=1)
df_final.head()

,Age,Years of Experience,Salary,Job Title Encoded,Eduation Level Encoded,Gender Encoded
47,45.0,16.0,180000.0,0,1,0
60,51.0,23.0,170000.0,1,1,0
63,47.0,21.0,180000.0,10,2,1
69,49.0,18.0,150000.0,11,1,0
77,32.0,6.0,100000.0,20,1,1

In [ ]:
# Displaying the final DataFrame's data types
df_final.info()

<class 'pandas.core.frame.DataFrame'>
Index: 147 entries, 47 to 374
Data columns (total 6 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Age                     147 non-null    float64
 1   Years of Experience     147 non-null    float64
 2   Salary                  147 non-null    float64
 3   Job Title Encoded       147 non-null    int8
 4   Eduation Level Encoded  147 non-null    int8
 5   Gender Encoded          147 non-null    int8
dtypes: float64(3), int8(3)
memory usage: 5.0 KB

In [ ]:
import numpy as np 
import pickle
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error

In [40]:
# Splitting the data into training and testing sets
X = df_final.iloc[:,[0,1,3,4,5]]
y = df_final.iloc[:,2]

In [42]:
# Creating and training the Linear Regression model
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

In [44]:
X_train.head()

,Age,Years of Experience,Job Title Encoded,Eduation Level Encoded,Gender Encoded
224,28.0,2.0,4,0,1
366,31.0,3.0,4,0,0
115,31.0,6.0,11,1,1
121,53.0,25.0,0,1,1
312,44.0,15.0,16,2,0

In [45]:
y_train.head()

224     40000.0
366     50000.0
115     95000.0
121    180000.0
312    150000.0
Name: Salary, dtype: float64

In [46]:
# Making predictions on the test set
reg = LinearRegression()
reg.fit(X_train, y_train)

LinearRegression()

In [47]:
# Calculating the Mean Squared Error
y_pred = reg.predict(X_test)

In [49]:
# Displaying the Mean Squared Error
err = np.sqrt(mean_squared_error(y_test, y_pred))

In [50]:
y_pred,y_test

(array([128147.93392055,  41909.19635678,  55403.86932187, 148609.66988595,
         87923.44464282, 186752.96112229, 116631.98197258,  88844.45580255,
         52757.18064477,  64954.96803052,  87557.85811014, 128274.35978376,
        164779.57150358, 101319.67928352, 183206.40454841, 134759.69827512,
        119205.17735738,  46739.116343  , 100135.32168465,  46197.78137203,
        175645.4321643 ,  56500.62891989,  87923.44464282,  66607.1522556 ,
         61421.93362363, 176200.85679135,  97787.21236571, 161289.37355398,
         52026.00757942, 188486.24217795]),
 315    130000.0
 310     35000.0
 351     55000.0
 285    150000.0
 213     85000.0
 63     180000.0
 331    130000.0
 358     95000.0
 263     50000.0
 156     50000.0
 364     90000.0
 104     80000.0
 176    140000.0
 154     95000.0
 88     135000.0
 234    140000.0
 264    110000.0
 336     40000.0
 290    110000.0
 250     40000.0
 279    180000.0
 301     55000.0
 314     85000.0
 122     50000.0
 369     60000.0
 130    160000.0
 275    120000.0
 69     150000.0
 354     50000.0
 217    180000.0
 Name: Salary, dtype: float64)

In [ ]:
err

15737.242137075868

In [52]:
# Saving the model using pickle
print(pd.DataFrame(zip(X.columns,reg.coef_)))
print(reg.intercept_)

                        0            1
0                     Age   555.424627
1     Years of Experience  6003.974646
2       Job Title Encoded   365.586533
3  Eduation Level Encoded  6281.410741
4          Gender Encoded  2646.688677
15699.160605781013

In [ ]:
# Loading the model from the pickle file
pickle.dump(reg,open('model.pkl','wb'))